MikroElektronika/core_packages/ARM/gcc_clang/def/pic32/PIC32CX2051BZ62132/mcu.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M4 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pfnMemoryManagement_Handler;             /* -12 Memory Management, MPU mismatch, including Access Violation and No Match */
  void* pfnBusFault_Handler;                     /* -11 Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault */
  void* pfnUsageFault_Handler;                   /* -10 Usage Fault, i.e. Undef Instruction, Illegal State Transition */
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pfnDebugMonitor_Handler;                 /*  -4 Debug Monitor */
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnRTC_Handler;                          /*   0 Real-Time Counter (RTC) */
  void* pfnEIC_Handler;                          /*   1 External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /*   2 Frequency Meter (FREQM) */
  void* pfnNVM_Handler;                          /*   3 flash controller (NVM) */
  void* pfnCHANGE_NOTICE_A_Handler;              /*   4 GPIO (GPIOA) */
  void* pfnCHANGE_NOTICE_B_Handler;              /*   5 GPIO (GPIOB) */
  void* pfnCHANGE_NOTICE_C_Handler;              /*   6 GPIO (GPIOC) */
  void* pfnCHANGE_NOTICE_D_Handler;              /*   7 GPIO (GPIOD) */
  void* pfnCHANGE_NOTICE_E_Handler;              /*   8 GPIO (GPIOE) */
  void* pfnDMAC_0_3_Handler;                     /*   9 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_4_15_Handler;                    /*  10 Direct Memory Access Controller (DMAC) */
  void* pfnEVSYS_0_3_Handler;                    /*  11 Event System Interface (EVSYS) */
  void* pfnEVSYS_4_11_Handler;                   /*  12 Event System Interface (EVSYS) */
  void* pfnPAC_Handler;                          /*  13 Peripheral Access Controller (PAC) */
  void* pfnRAMECC_Handler;                       /*  14 RAM ECC (RAMECC) */
  void* pfnSERCOM0_Handler;                      /*  15 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_Handler;                      /*  16 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_Handler;                      /*  17 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM3_Handler;                      /*  18 Serial Communication Interface (SERCOM3) */
  void* pfnSERCOM4_Handler;                      /*  19 Serial Communication Interface (SERCOM4) */
  void* pfnSERCOM5_Handler;                      /*  20 Serial Communication Interface (SERCOM5) */
  void* pfnSERCOM6_Handler;                      /*  21 Serial Communication Interface (SERCOM6) */
  void* pfnTCC0_Handler;                         /*  22 Timer Counter Control (TCC0) */
  void* pfnTCC1_Handler;                         /*  23 Timer Counter Control (TCC1) */
  void* pfnTCC2_Handler;                         /*  24 Timer Counter Control (TCC2) */
  void* pfnTC0_Handler;                          /*  25 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  26 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  27 Basic Timer Counter (TC2) */
  void* pfnTC3_Handler;                          /*  28 Basic Timer Counter (TC3) */
  void* pfnTC4_Handler;                          /*  29 Basic Timer Counter (TC4) */
  void* pfnTC5_Handler;                          /*  30 Basic Timer Counter (TC5) */
  void* pfnTC6_Handler;                          /*  31 Basic Timer Counter (TC6) */
  void* pfnTC7_Handler;                          /*  32 Basic Timer Counter (TC7) */
  void* pfnTC8_Handler;                          /*  33 Basic Timer Counter (TC8) */
  void* pfnTC9_Handler;                          /*  34 Basic Timer Counter (TC9) */
  void* pfnADCHS_IRQ_Handler;                    /*  35 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADCHS_FAULT_Handler;                  /*  36 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADCHS_FCC_Handler;                    /*  37 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnADCHS_BGVR_RDY_Handler;               /*  38 12-bit Analog to Digital Converter (ADCHS) */
  void* pfnAC_Handler;                           /*  39 Analog Comparators (AC) */
  void* pfnCRYPTO_0_Handler;                     /*  40  (CRYPTO) */
  void* pfnCRYPTO_1_Handler;                     /*  41  (CRYPTO) */
  void* pfnQSPI_Handler;                         /*  42 Quad SPI interface (QSPI) */
  void* pfnZB_INT0_Handler;                      /*  43 ZigBee MAC DOS (ZIGBEE) */
  void* pfnBT_INT0_Handler;                      /*  44 BLE (BLE) */
  void* pfnBT_INT1_Handler;                      /*  45 BLE (BLE) */
  void* pfnARBITER_Handler;                      /*  46 Radio Arbiter (ARB) */
  void* pfnCLKI_WAKEUP_NMI_Handler;              /*  47 BLE (BLE) */
  void* pfnCVD_Handler;                          /*  48 Hardware CVD Controller Macro (CVD) */
  void* pfnCRYPTO_2_Handler;                     /*  49  (CRYPTO) */
  void* pfnQEI_Handler;                          /*  50  (QEI) */
  void* pfnCAN0_Handler;                         /*  51 Control Area Network (CAN0) */
  void* pfnCAN1_Handler;                         /*  52 Control Area Network (CAN1) */
  void* pfnETH_Handler;                          /*  53 Ethernet Controller (ETH) */
  void* pfnUSB_Handler;                          /*  54 USB (USB) */
  void* pfnPLL_LOCK_BOOT_Handler;                /*  55 BT ZB Subsystem (BTZBSYS) */
  void* pfnPLL_LOCK_USER_Handler;                /*  56 BT ZB Subsystem (BTZBSYS) */
  void* pfnBT_LC_Handler;                        /*  57 BLE (BLE) */
} DeviceVectors;

